# -*- mode: org; -*-
# Time-stamp: <2021-06-22 Tue 21:06 slumos@stevenlum-ltm>
#+DESCRIPTION: My nice =~/.config/emacs configuration.
#+KEYWORDS:  emacs org
#+LANGUAGE:  en
#+STARTUP: entitiespretty overview
#+TODO: TODO(t) TRYING(r) BROKEN(t) SKIP(s) | DONE(d)
#+FILETAGS: :emacs:config:
#+CATEGORY: EMACS
#+PROPERTY: header-args    :results silent

[[http://oremacs.com/lispy/][lispy.el function reference]]

**** COMMENT testing
     #+begin_src sh :results output raw drawer replace
     date
     #+end_src

     #+RESULTS:
     :results:
     Thu May 28 10:09:39 PDT 2020
     :end:

** Getting customized vars to copy to use-package blocks
   #+begin_src emacs-lisp :results value table drawer replace :tangle no
     (let ((found nil))
           (mapatoms (lambda (sym)
                       (let ((val (get sym 'customized-value))
                             (comment (get sym 'customized-variable-comment)))
                         (if (car val) (push (list sym val comment) found)))))
           found)
   #+end_src

   #+RESULTS:
   :results:
   | magit-file-mode               | (t)                                                                | Customized with use-package magit     |
   | transient-default-level       | (5)                                                                | Customized with use-package magit     |
   | magit-repository-directories  | ('((~/Projects . 1) (~/Projects/iac . 1) (~/Projects/puppet . 1))) | Customized with use-package magit     |
   | magit-clone-default-directory | (~/Projects/)                                                      | Customized with use-package magit     |
   | doom-modeline-icon            | (t)                                                                | Use all-the-icons                     |
   | auto-revert-verbose           | (t)                                                                | Customized with use-package magit     |
   | forge-topic-list-limit        | ('(60 . 0))                                                        | Customized with use-package magit     |
   | yas-snippet-dirs              | ('(/Users/slumos/.config/emacs/snippets))                          | Customized with use-package yasnippet |
   :end:
